org/numpy-learn.org
#+TITLE: Numpy Learn
** Numpy Learn
*** Data Types

    show numpy data types.

| S.No | Data Types                                | Description                                                                   |
|------+-------------------------------------------+-------------------------------------------------------------------------------|
|    1 | bool                                      | Boolean (True or False) stored as a bytes                                     |
|    2 | int                                       | Default integer type (same as C long; normally either int64 or int32)         |
|    3 | intc                                      | Identical to C int (normally int32 or int64)                                  |
|    4 | intp                                      | Integer used for indexing (same as C ssize_t; normally either int32 or int64) |
|    5 | int8                                      | Byte (-128 to 127)                                                            |
|    6 | int16                                     | Integer (-32768 to 32768)                                    goods/                 |
|    7 | int32                                     | Integer (-2147483648 to 2147483647)                                           |
*** Python block code in org mode
    #+BEGIN_SRC python :results output html
      import numpy as np

      test = np.arange(50).reshape((5, 2, 5))
      print(test)
    #+END_SRC

    #+RESULTS:
    #+BEGIN_EXPORT html
    [[[ 0  1  2  3  4]
      [ 5  6  7  8  9]]

     [[10 11 12 13 14]
      [15 16 17 18 19]]

     [[20 21 22 23 24]
      [25 26 27 28 29]]

     [[30 31 32 33 34]
      [35 36 37 38 39]]

     [[40 41 42 43 44]
      [45 46 47 48 49]]]
    #+END_EXPORT
