numpy-learn.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-02-28 二 17:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" title="Standard" href="/worg/style/worg.css" type="text/css" />
<link rel="alternate stylesheet" title="Zenburn" href="/worg/style/worg-zenburn.css" type="text/css" />
<link rel="alternate stylesheet" title="Classic" href="/worg/style/worg-classic.css" type="text/css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org941ac4d">Numpy Learn</a>
<ul>
<li><a href="#org7b77608">Data Types</a></li>
<li><a href="#org9c97137">Python block code in org mode</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org941ac4d" class="outline-2">
<h2 id="org941ac4d">Numpy Learn</h2>
<div class="outline-text-2" id="text-org941ac4d">
</div><div id="outline-container-org7b77608" class="outline-3">
<h3 id="org7b77608">Data Types</h3>
<div class="outline-text-3" id="text-org7b77608">
<p>
show numpy data types.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">S.No</th>
<th scope="col" class="org-left">Data Types</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">bool</td>
<td class="org-left">Boolean (True or False) stored as a bytes</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">int</td>
<td class="org-left">Default integer type (same as C long; normally either int64 or int32)</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">intc</td>
<td class="org-left">Identical to C int (normally int32 or int64)</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">intp</td>
<td class="org-left">Integer used for indexing (same as C ssize<sub>t</sub>; normally either int32 or int64)</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">int8</td>
<td class="org-left">Byte (-128 to 127)</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">int16</td>
<td class="org-left">Integer (-32768 to 32768)</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-left">int32</td>
<td class="org-left">Integer (-2147483648 to 2147483647)</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org9c97137" class="outline-3">
<h3 id="org9c97137">Python block code in org mode</h3>
<div class="outline-text-3" id="text-org9c97137">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> numpy <span style="color: #4f97d7; font-weight: bold;">as</span> np

<span style="color: #7590db;">test</span> = np.arange<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">50</span><span style="color: #4f97d7;">)</span>.reshape<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">5</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">5</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>test<span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id='disqus_thread'></div>
                <script type='text/javascript'>
                    /* * * CONFIGURATION VARIABLES * * */
                    var disqus_shortname = 'callmesanye';

                    /* * * DON'T EDIT BELOW THIS LINE * * */
                    (function() {
                        var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
                        dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
                        (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
                    })();
                </script>
                <noscript>Please enable JavaScript to view the <a href='https://disqus.com/?ref_noscript' rel='nofollow'>comments powered by Disqus.</a></noscript>
                <p> Created by <a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 9.0.5) </p>
                <a href='#' class='back-to-top' id='fixed-back-to-top' style='display: inline;'></a>
</div>
</body>
</html>
